scarv/miracle/target/cw308_stm32f4_16mhz/bsp/stm32f4_hal_lowlevel.c
  ///* Select data Direction */ 
  //CRYP->CR &= ~CRYP_CR_ALGODIR;
  //CRYP->CR |= CRYP_InitStruct->CRYP_AlgoDir;
//}

///**
  //* @brief  Initializes the CRYP Keys according to the specified parameters in
  //*         the CRYP_KeyInitStruct.
  //* @param  CRYP_KeyInitStruct: pointer to a CRYP_KeyInitTypeDef structure that
  //*         contains the configuration information for the CRYP Keys.
  //* @retval None
  //*/
//void CRYP_KeyInit(CRYP_KeyInitTypeDef* CRYP_KeyInitStruct)
//{
  ///* Key Initialisation */
  //CRYP->K0LR = CRYP_KeyInitStruct->CRYP_Key0Left;
  //CRYP->K0RR = CRYP_KeyInitStruct->CRYP_Key0Right;
  //CRYP->K1LR = CRYP_KeyInitStruct->CRYP_Key1Left;
  //CRYP->K1RR = CRYP_KeyInitStruct->CRYP_Key1Right;
  //CRYP->K2LR = CRYP_KeyInitStruct->CRYP_Key2Left;
  //CRYP->K2RR = CRYP_KeyInitStruct->CRYP_Key2Right;
  //CRYP->K3LR = CRYP_KeyInitStruct->CRYP_Key3Left;
  //CRYP->K3RR = CRYP_KeyInitStruct->CRYP_Key3Right;
//}

///**
  //* @brief  Enables or disables the CRYP peripheral.
  //* @param  NewState: new state of the CRYP peripheral.
  //*          This parameter can be: ENABLE or DISABLE.
  //* @retval None
  //*/
//void CRYP_Cmd(FunctionalState NewState)
//{
  ///* Check the parameters */
  //assert_param(IS_FUNCTIONAL_STATE(NewState));

  //if (NewState != DISABLE)
  //{
    ///* Enable the Cryptographic processor */
    //CRYP->CR |= CRYP_CR_CRYPEN;
  //}
  //else
  //{
    ///* Disable the Cryptographic processor */
    //CRYP->CR &= ~CRYP_CR_CRYPEN;
  //}
//}

///**
  //* @brief  Returns whether CRYP peripheral is enabled or disabled.
  //* @param  none.
  //* @retval Current state of the CRYP peripheral (ENABLE or DISABLE).
  //*/
//FunctionalState CRYP_GetCmdStatus(void)
//{
  //FunctionalState state = DISABLE;

  //if ((CRYP->CR & CRYP_CR_CRYPEN) != 0)
  //{
    ///* CRYPEN bit is set */
    //state = ENABLE;
  //}
  //else
  //{
    ///* CRYPEN bit is reset */
    //state = DISABLE;
  //}
  //return state;
//}

///**
  //* @brief  Writes data in the Data Input register (DIN).
  //* @note   After the DIN register has been read once or several times, 
  //*         the FIFO must be flushed (using CRYP_FIFOFlush() function).  
  //* @param  Data: data to write in Data Input register
  //* @retval None
  //*/
//void CRYP_DataIn(uint32_t Data)
//{
  //CRYP->DR = Data;
//}

///**
  //* @brief  Returns the last data entered into the output FIFO.
  //* @param  None
  //* @retval Last data entered into the output FIFO.
  //*/
//uint32_t CRYP_DataOut(void)
//{
  //return CRYP->DOUT;
//}

///**
  //* @brief  Checks whether the specified CRYP flag is set or not.
  //* @param  CRYP_FLAG: specifies the CRYP flag to check.
  //*          This parameter can be one of the following values:
  //*            @arg CRYP_FLAG_IFEM: Input FIFO Empty flag.
  //*            @arg CRYP_FLAG_IFNF: Input FIFO Not Full flag.
  //*            @arg CRYP_FLAG_OFNE: Output FIFO Not Empty flag.
  //*            @arg CRYP_FLAG_OFFU: Output FIFO Full flag.
  //*            @arg CRYP_FLAG_BUSY: Busy flag.
  //*            @arg CRYP_FLAG_OUTRIS: Output FIFO raw interrupt flag.
  //*            @arg CRYP_FLAG_INRIS: Input FIFO raw interrupt flag.
  //* @retval The new state of CRYP_FLAG (SET or RESET).
  //*/
//FlagStatus CRYP_GetFlagStatus(uint8_t CRYP_FLAG)
//{
  //FlagStatus bitstatus = RESET;
  //uint32_t tempreg = 0;

  ///* Check the parameters */
  //assert_param(IS_CRYP_GET_FLAG(CRYP_FLAG));

  ///* check if the FLAG is in RISR register */
  //if ((CRYP_FLAG & FLAG_MASK) != 0x00) 
  //{
    //tempreg = CRYP->RISR;
  //}
  //else  /* The FLAG is in SR register */
  //{
    //tempreg = CRYP->SR;
  //}


  ///* Check the status of the specified CRYP flag */
  //if ((tempreg & CRYP_FLAG ) != (uint8_t)RESET)
  //{
    ///* CRYP_FLAG is set */
    //bitstatus = SET;
  //}
  //else
  //{
    ///* CRYP_FLAG is reset */
    //bitstatus = RESET;
  //}

  ///* Return the CRYP_FLAG status */
  //return  bitstatus;
//}

///// ----- From stm32f4xx_cryp_aes.c --------------------------------------------
//#define AESBUSY_TIMEOUT    ((uint32_t) 0x00010000)

///**
  //* @brief  Encrypt and decrypt using AES in ECB Mode
  //* @param  Mode: encryption or decryption Mode.
  //*          This parameter can be one of the following values:
  //*            @arg MODE_ENCRYPT: Encryption
  //*            @arg MODE_DECRYPT: Decryption
  //* @param  Key: Key used for AES algorithm.
  //* @param  Keysize: length of the Key, must be a 128, 192 or 256.
  //* @param  Input: pointer to the Input buffer.
  //* @param  Ilength: length of the Input buffer, must be a multiple of 16.
  //* @param  Output: pointer to the returned buffer.
  //* @retval An ErrorStatus enumeration value:
  //*          - SUCCESS: Operation done
  //*          - ERROR: Operation failed
  //*/
//ErrorStatus CRYP_AES_ECB(uint8_t Mode, uint8_t* Key, uint16_t Keysize,
                         //uint8_t* Input, uint32_t Ilength, uint8_t* Output)
//{
  //CRYP_InitTypeDef AES_CRYP_InitStructure;
  //CRYP_KeyInitTypeDef AES_CRYP_KeyInitStructure;
  //__IO uint32_t counter = 0;
  //uint32_t busystatus = 0;
  //ErrorStatus status = SUCCESS;
  //uint32_t keyaddr    = (uint32_t)Key;
  //uint32_t inputaddr  = (uint32_t)Input;
  //uint32_t outputaddr = (uint32_t)Output;
  //uint32_t i = 0;

  ///* Crypto structures initialisation*/
  //CRYP_KeyStructInit(&AES_CRYP_KeyInitStructure);

  //switch(Keysize)
  //{
    //case 128:
    //AES_CRYP_InitStructure.CRYP_KeySize = CRYP_KeySize_128b;
    //AES_CRYP_KeyInitStructure.CRYP_Key2Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key2Right= __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key3Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key3Right= __REV(*(uint32_t*)(keyaddr));
    //break;
    //case 192:
    //AES_CRYP_InitStructure.CRYP_KeySize  = CRYP_KeySize_192b;
    //AES_CRYP_KeyInitStructure.CRYP_Key1Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key1Right= __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key2Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key2Right= __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key3Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key3Right= __REV(*(uint32_t*)(keyaddr));
    //break;
    //case 256:
    //AES_CRYP_InitStructure.CRYP_KeySize  = CRYP_KeySize_256b;
    //AES_CRYP_KeyInitStructure.CRYP_Key0Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key0Right= __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key1Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key1Right= __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key2Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key2Right= __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key3Left = __REV(*(uint32_t*)(keyaddr));
    //keyaddr+=4;
    //AES_CRYP_KeyInitStructure.CRYP_Key3Right= __REV(*(uint32_t*)(keyaddr));
    //break;
    //default:
    //break;
  //}
  
  ///*------------------ AES Decryption ------------------*/
  //if(Mode == MODE_DECRYPT) /* AES decryption */
  //{
    ///* Flush IN/OUT FIFOs */
    //CRYP_FIFOFlush();

    ///* Crypto Init for Key preparation for decryption process */
    //AES_CRYP_InitStructure.CRYP_AlgoDir = CRYP_AlgoDir_Decrypt;
    //AES_CRYP_InitStructure.CRYP_AlgoMode = CRYP_AlgoMode_AES_Key;
    //AES_CRYP_InitStructure.CRYP_DataType = CRYP_DataType_32b;
    //CRYP_Init(&AES_CRYP_InitStructure);

    ///* Key Initialisation */
    //CRYP_KeyInit(&AES_CRYP_KeyInitStructure);

    ///* Enable Crypto processor */
    //CRYP_Cmd(ENABLE);

    ///* wait until the Busy flag is RESET */
    //do
    //{
      //busystatus = CRYP_GetFlagStatus(CRYP_FLAG_BUSY);
      //counter++;
    //}while ((counter != AESBUSY_TIMEOUT) && (busystatus != RESET));

    //if (busystatus != RESET)
   //{
       //status = ERROR;
    //}
    //else
    //{
      ///* Crypto Init for decryption process */  
      //AES_CRYP_InitStructure.CRYP_AlgoDir = CRYP_AlgoDir_Decrypt;
    //}
  //}
  ///*------------------ AES Encryption ------------------*/
  //else /* AES encryption */
  //{

    //CRYP_KeyInit(&AES_CRYP_KeyInitStructure);

